In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

In [2]:
mydata=pd.read_excel(r"C:\Users\mail2\OneDrive\Desktop\Ml_Data\Population_Summary.xlsx")

In [13]:
mydata.head(1)
#mydata.tail()
#mydata.sample(1)

,Rank,State_UT,Population,Rulal,Urban,Share,Growth,Country,World_Rank
0,1,Uttar Pradesh,199812341,77.73,22.27,16.5,20.23,Brazil,5

In [16]:
#mydata.describe().T

In [18]:
#mydata.info()

In [21]:
st=mydata[["State_UT","Population"]]

In [23]:
#st

In [25]:
#mydata.columns
mydata.keys()

Index(['Rank', 'State_UT', 'Population', 'Rulal', 'Urban', 'Share', 'Growth',
       'Country', 'World_Rank'],
      dtype='object')

In [26]:
mydata.head(1)

,Rank,State_UT,Population,Rulal,Urban,Share,Growth,Country,World_Rank
0,1,Uttar Pradesh,199812341,77.73,22.27,16.5,20.23,Brazil,5

In [27]:
mydata["Growth"].min()

-0.58

In [29]:
mydata[mydata["Growth"]==mydata["Growth"].min()]

,Rank,State_UT,Population,Rulal,Urban,Share,Growth,Country,World_Rank
24,24,Nagaland,1978502,71.14,28.86,0.16,-0.58,Botswana,148

In [30]:
mydata["Population"].sum(axis=0)

1210854977

In [31]:
mydata["%Pop"]=mydata["Population"]/mydata["Population"].sum(axis=0)

In [33]:
#mydata

In [40]:
kp=mydata[mydata["State_UT"]=="Karnataka"]["Population"].values[0]

In [45]:
#kp

In [46]:
#len(mydata[mydata["Population"]>kp])

In [47]:
#mydata[mydata["Population"]>kp]["State_UT"]

In [50]:
#mydata.iloc[:10,2:4]

In [52]:
mydata.loc[:10,"State_UT":"Population"]

          State_UT  Population
0    Uttar Pradesh   199812341
1      Maharashtra   112374333
2            Bihar   104099452
3      West Bengal    91276115
4   Andhra Pradesh    84580777
5   Madhya Pradesh    72626809
6       Tamil Nadu    72147030
7        Rajasthan    68548437
8        Karnataka    61095297
9          Gujarat    60439692
10          Odisha    41974218